notes/huggingface-transformers-mainclasses-callback.org
#+title: huggingface transformers 源码剖析(一) 
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/worg.css" />
#+date: Tue Nov 23 15:37:36 2021
#+author: Zi Liang
#+email: liangzid@stu.xjtu.edu.cn
#+latex_class: elegantpaper
#+filetags: transformers:nlp:

* Logging
transformers也提供了logging功能，类似于python标准库中的实现。我还是建议使用默认的python库中的logging，你可以在[[https://docs.python.org/3/library/logging.html][这里]]找到相关信息。如果你还是想使用transformers.logging做日志，那么你可以使用以下API：

#+BEGIN_SRC python
  import transformers.logging as logging

  # ## get logger
  # logging.get_logger()

  ## set level
  logging.set_verbosity_error()
  logging.set_verbosity_warning()
  logging.set_verbosity_info()
  logging.set_verbosity_debug()

  logging.set_verbosity(p) # where p can be int: 10(debug),20(info),30(warning),40(error),50(critical)
  # you can get the int value by logging.DEBUG, logging.INFO, ...

  ## get level
  logging.get_verbosity()

#+END_SRC

* Tokenizer

* Models

* Model outputs

* Optimization

* Configuration

* Processors

* Callbacks

* Pipelines

