huggingface-transformers-mainclasses-callback.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-10 Mon 20:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>huggingface transformers 源码剖析(一)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zi Liang" />
<link rel="stylesheet" type="text/css" href="./css/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">huggingface transformers 源码剖析(一)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e6faeb">1. Logging</a></li>
<li><a href="#org41bced3">2. Tokenizer</a></li>
<li><a href="#org2506fb5">3. Models</a></li>
<li><a href="#org1b5116d">4. Model outputs</a></li>
<li><a href="#orgbc9e083">5. Optimization</a></li>
<li><a href="#orgd560f0f">6. Configuration</a></li>
<li><a href="#org38fa8e5">7. Processors</a></li>
<li><a href="#org6244926">8. Callbacks</a></li>
<li><a href="#org83aa1ba">9. Pipelines</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9e6faeb" class="outline-2">
<h2 id="org9e6faeb"><span class="section-number-2">1</span> Logging</h2>
<div class="outline-text-2" id="text-1">
<p>
transformers也提供了logging功能，类似于python标准库中的实现。我还是建议使用默认的python库中的logging，你可以在<a href="https://docs.python.org/3/library/logging.html">这里</a>找到相关信息。如果你还是想使用transformers.logging做日志，那么你可以使用以下API：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #FF1493;">import</span> transformers.logging <span style="color: #FF1493;">as</span> logging

<span style="color: #8B8878;"># </span><span style="color: #8B8878;">## get logger</span>
<span style="color: #8B8878;"># </span><span style="color: #8B8878;">logging.get_logger()</span>

<span style="color: #8B8878;">## </span><span style="color: #8B8878;">set level</span>
logging.set_verbosity_error<span style="color: #AF87FF;">()</span>
logging.set_verbosity_warning<span style="color: #AF87FF;">()</span>
logging.set_verbosity_info<span style="color: #AF87FF;">()</span>
logging.set_verbosity_debug<span style="color: #AF87FF;">()</span>

logging.set_verbosity<span style="color: #AF87FF;">(</span>p<span style="color: #AF87FF;">)</span> <span style="color: #8B8878;"># </span><span style="color: #8B8878;">where p can be int: 10(debug),20(info),30(warning),40(error),50(critical)</span>
<span style="color: #8B8878;"># </span><span style="color: #8B8878;">you can get the int value by logging.DEBUG, logging.INFO, ...</span>

<span style="color: #8B8878;">## </span><span style="color: #8B8878;">get level</span>
logging.get_verbosity<span style="color: #AF87FF;">()</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org41bced3" class="outline-2">
<h2 id="org41bced3"><span class="section-number-2">2</span> Tokenizer</h2>
</div>

<div id="outline-container-org2506fb5" class="outline-2">
<h2 id="org2506fb5"><span class="section-number-2">3</span> Models</h2>
</div>

<div id="outline-container-org1b5116d" class="outline-2">
<h2 id="org1b5116d"><span class="section-number-2">4</span> Model outputs</h2>
</div>

<div id="outline-container-orgbc9e083" class="outline-2">
<h2 id="orgbc9e083"><span class="section-number-2">5</span> Optimization</h2>
</div>

<div id="outline-container-orgd560f0f" class="outline-2">
<h2 id="orgd560f0f"><span class="section-number-2">6</span> Configuration</h2>
</div>

<div id="outline-container-org38fa8e5" class="outline-2">
<h2 id="org38fa8e5"><span class="section-number-2">7</span> Processors</h2>
</div>

<div id="outline-container-org6244926" class="outline-2">
<h2 id="org6244926"><span class="section-number-2">8</span> Callbacks</h2>
</div>

<div id="outline-container-org83aa1ba" class="outline-2">
<h2 id="org83aa1ba"><span class="section-number-2">9</span> Pipelines</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Tue Nov 23 15:37:36 2021</p>
<p class="author">Author: Zi Liang</p>
<p class="date">Created: 2022-01-10 Mon 20:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
